<template>
  <div class="lg:max-w-7xl w-full ml-auto mr-auto">
    <div class="lg:px-[64px] md:px-[32px] px-[24px] py-[40px]">
      <div class="py-[55px] flex items-center justify-between">
        <div>
          <h1>Asynchronous - Асинхронӣ</h1>
        <p>Asynchrony дар Python як консепсияи барномасозӣ мебошад, ки имкон медиҳад, ки вазифаҳо бидуни интизории анҷоми вазифаҳои қаблӣ новобаста аз ҳамдигар иҷро карда шаванд. Ба ҷои бастани иҷрои барнома ҳангоми интизорӣ, асинхронӣ ба шумо имкон медиҳад, ки бидуни қатъи иҷрои риштаи асосӣ байни вазифаҳои гуногун гузаред.</p>
        <p>Дар заминаи барномасозии асинхронӣ, одатан барои ноил шудан ба коркарди самараноки вазифаҳои сершумор, конструксияҳо ва механизмҳои махсус истифода мешаванд. Биёед дар ин бора муфассалтар гап занем.</p>
        <p>Дар Python асинхронӣ бо истифода аз модули `asyncio` амалӣ карда мешавад, ки асбобҳоро барои эҷоди барномаҳои асинхронӣ таъмин мекунад. Функсияҳои асинхронӣ бо калимаи калидии `async` ишора карда мешаванд ва ин гуна функсияҳо корутинҳо ва даври рӯйдодҳоро барои идоракунии амалиёти асинхронӣ истифода мебаранд.</p>

        <h4>Намунаи функсияи асинхронӣ дар Python:</h4>
        <pre><code>
    import asyncio

    async def fetch_data(url):

    print("Начало загрузки данных")

    await asyncio.sleep(3)  # Имитация задержки при загрузке

    print("Данные загружены")

    async def main():

    tasks = [fetch_data("http://example.com") for _ in range(5)]

    await asyncio.gather(*tasks)

    if __name__ == "__main__":

    asyncio.run(main())
        </code></pre>
        <p>Дар ин мисол, функсияи <code>fetch_data</code> асинхронӣ аст ва боркунии маълумотро бо таъхир тақлид мекунад. Функсияи <code>main</code> якчанд вазифаҳоро (корутинҳо) эҷод мекунад ва онҳоро ба таври асинхронӣ бо истифода аз даври рӯйдодҳо иҷро мекунад.</p>
        <h3>Барномасозии асинхронӣ дар Python: Принсипҳо ва консепсияҳо</h3>
        <p>Барномасозии асинхронӣ дар Python ба идеяи идоракунии самараноки вазифаҳои сершумор бидуни бастани риштаи асосӣ асос ёфтааст. Ин махсусан барои амалиётҳои воридотӣ / баромад муфид аст, ба монанди дархостҳои шабакавӣ ва хондан-навиштҳои файл, ки дар давоми он риштаи асосӣ метавонад ба дигар вазифаҳо гузарад.</p>
        <h4>Баъзе принсипҳо ва консепсияҳои асосии барномасозии асинхронӣ дар Python:</h4>
        <p>1. Корутинҳо (Coroutines) - механизми асосии барномасозии асинхронӣ дар Python мебошанд. Корутинҳо функсияҳои асинхронӣ мебошанд, ки метавонанд иҷрои онҳоро таваққуф кунанд ва ба корутинҳои дигар имкон медиҳанд, ки дар фосилавӣ кор кунанд. Калимаи калидии <code>async</code> барои ифодаи корутинҳо истифода мешавад.</p>
        <pre><code>
    async def my_coroutine():

    # Асинхронные операции

    await asyncio.sleep(1)

    print("Корутина завершилась")
        </code></pre>
        <p>2. Доираи рӯйдодҳо (Event Loop) - механизми асосии идоракунии вазифаҳои асинхронӣ мебошад. Он ҳамчун ҳалқае кор мекунад, ки доимо ҳолати корутинҳоро тафтиш мекунад ва ҳангоми омодагии онҳо барои идомаи кори худ иҷрои онҳоро оғоз мекунад.</p>
        <pre><code>
    import asyncio

    async def main():

    # Создаем событийный цикл

    loop = asyncio.get_event_loop()

    # Запускаем корутину в событийном цикле

    loop.create_task(my_coroutine())

    # Запускаем событийный цикл

    loop.run_forever()

    # Вызываем функцию main

    asyncio.run(main())
        </code></pre>
        <p>3. Калимаи калидии <code>await</code> дар вазифаи асинхронӣ истифода мешавад, то анҷоми амалиёти асинхронии дигарро интизор шавад. Функсияи <code>asyncio.sleep()</code> барои тақлид кардани таъхир дар иҷро истифода мешавад.</p>
        <pre><code>
    import asyncio

    async def my_coroutine():

    print("Начало корутины")

    await asyncio.sleep(1)

    print("Корутина завершилась")

    asyncio.run(my_coroutine())
        </code></pre>
        <h3>
            Асбобҳо ва китобхонаҳои Python барои барномасозии асинхронӣ
        </h3>
        <p>Дар Python якчанд асбобҳо ва китобхонаҳо мавҷуданд, ки барои барномасозии асинхронӣ дастгирӣ мекунанд.</p>
        <ul>
            <li>`asyncio` китобхонаи стандартии Python барои барномасозии асинхронӣ мебошад. Он як даври рӯйдодҳоро дар бар мегирад, ки вазифаҳои асинхронӣ ва корутинҳоро идора мекунад. `asyncio` API-ро барои кор бо розеткаҳо, рӯйдодҳо, таймерҳо ва дигар амалиётҳои асинхронӣ таъмин мекунад.</li>
            <li>`aiohttp` китобхона барои қабули дархостҳои шабакаи асинхронӣ мебошад. Он муштариёни асинхронии HTTP ва WebSocket-ро таъмин мекунад, ки ба шумо имкон медиҳад, ки амалиёти шабакаро ба таври асинхронӣ иҷро кунед.</li>
            <li>`aiomysql`, `aiopg` - инҳо китобхонаҳо барои ҳамкории асинхронӣ бо пойгоҳи додаҳои MySQL ва PostgreSQL мебошанд. Онҳо ба шумо имкон медиҳанд, ки пойгоҳи додаҳоро ба таври асинхронӣ дархост кунед, ки ҳангоми кор бо шумораи зиёди дархостҳо муфид аст.</li>
            <li>`aiofiles` китобхонаест, ки амалиёти асинхронӣ барои кор бо файлҳоро таъмин мекунад. Он ба шумо имкон медиҳад, ки файлҳоро ба таври асинхронӣ хонед, нависед ва идора кунед.</li>
            <li>`asyncpg` китобхонаест, ки барои муоширати асинхронӣ бо пойгоҳи додаҳои PostgreSQL. Он ҳангоми иҷрои дархостҳои асинхронии пойгоҳи додаҳо иҷрои баландро таъмин мекунад.</li>
            <li>`trio` китобхонаи алтернативии барномасозии асинхронӣ мебошад, ки API-и соддатар ва беихтиёртарро барои амалиёти асинхронӣ таъмин мекунад.</li>
            <li>`curio` китобхонаи дигари алтернативии барномасозии асинхронӣ аст, ки синтаксиси соддатар ва назорати амалиёти асинхронӣ таъмин менамояд.</li>
        </ul>
        <h3>
            Афзалиятҳо ва нуқсонҳои асинхронӣ дар Python
        </h3>
        <h4>Афзалиятҳо:</h4>
        <ul>
            <li>Самаранокии вуруд / баромад. Бартарии асосии барномасозии асинхронӣ ин коркарди самараноки амалиётҳои воридотӣ / баромад ба монанди дархостҳои шабакавӣ, пойгоҳи додаҳо ва амалиёти файл мебошад. Ба ҷои мунтазири анҷоми ҳар як амалиёт, вазифаҳои асинхронӣ метавонанд байни ҳамдигар гузаранд ва имкон медиҳанд, ки захираҳои протсессор ва пайвастҳои шабакаро ҳадди аксар истифода баранд.</li>
            <li>Ҷавобгарӣ. Барномасозии асинхронӣ ба шумо имкон медиҳад, ки замимаҳои ҷавобгӯро эҷод кунед, ки метавонанд коркарди дархостҳоро идома диҳанд ва ҳатто ҳангоми иҷрои амалиёти дарозмуддат бо корбар муошират кунанд. Ин махсусан ҳангоми таҳияи серверҳои веб ва барномаҳои муштарии GUI муфид аст.</li>
            <li>Параллелизм. Асинхронӣ қобилияти иҷро кардани вазифаҳои сершуморро дар як вақт таъмин мекунад, ки иҷрои барнома ва вақти посухро беҳтар мекунад. Ин махсусан дар ҳолатҳое муҳим аст, ки вазифаҳо мустақиланд ва метавонанд дар баробари иҷро шаванд.</li>
        </ul>
        <h4>Нуқсонҳо:</h4>
        <ul>
            <li>Мушкилоти код. Фаҳмидани барномасозии асинхронӣ метавонад душвор бошад, махсусан барои таҳиягарони нав. Механизмҳои асинхронӣ ба монанди корутинҳо ва ҳалқаҳои рӯйдодҳо метавонанд ношинос бошанд ва барои истифодаи самаранок сатҳи муайяни таҷрибаро талаб кунанд.</li>
            <li>Мушкилии тарҳрезӣ. Тарҳрезии дурусти барномаҳои асинхронӣ банақшагирии дақиқ ва идоракунии вазифаҳоро талаб мекунад. На ҳама вақт маълум аст, ки кадом вазифаҳо ба асинхронӣ беҳтар дода мешаванд ва кадом амалҳоро дар баробари иҷро кардан мумкин аст.</li>
            <li>Норавшании хатогиҳо. Хатогиҳо дар барномаҳои асинхронӣ метавонанд номуайян ва ошкор кардани онҳо душвор бошанд. Дастрасии синхронӣ ба додаҳо метавонад ба шароити нажод ва мушкилоти дигаре оварда расонад, ки на ҳамеша муайян кардан ва ислоҳ кардан осон нестанд.</li>
        </ul>
        <h3>Маводҳо барои мутоила:</h3>
        <ul>
          <li>"Using Asyncio in Python" / Caleb Hattingh <a
              href="https://edu.anarcho-copy.org/Programming%20Languages/Python/using-asyncio-python-understanding-asynchronous.pdf">(скачать
              PDF)</a></li>
          <li>"Введение в асинхронное программирование" / Dave Peticolas <a
              href="https://lib.intuit.kg/wp-content/uploads/2020/04/%D0%90%D1%81%D0%B8%D0%BD%D1%85%D1%80%D0%BE%D0%BD%D0%BD%D0%BE%D0%B5-%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5-ru.pdf">(скачать
              PDF)</a>
          </li>
          <li>"Основы программирования на языке Python" / С К Буйначев, Н Ю Боклаг <a
              href="https://elar.urfu.ru/bitstream/10995/28769/1/978-5-7996-1198-9_2014.pdf">(скачать
              PDF)</a></li>
        </ul>
        <h3>Интернет – сомонаҳо бо маводҳо барои мутоила:</h3>
        <ul>
          <li><a href="https://habr.com/ru/articles/667630/">Хабр</a></li>
          <li><a href="https://school.kontur.ru/publications/2567">Асинхронное программирование на Python</a></li>
          <li><a href="https://sky.pro/media/kak-rabotat-s-asinhronnostyu-v-python/">Как работать с асинхронностью в Python</a></li>
        </ul>
        <h3>Курсҳои омӯзишӣ бо воситаи Интернет дар Coursera, EdX, Khan Academy, Udemy:</h3>
        <ul>
          <li><a href="https://learning.edx.org/course/course-v1:Microsoft+DEV234x+3T2017a/home">Course | Asynchronous Programming</a></li>
          <li><a href="https://www.udemy.com/course/asynchronous-python-for-beginners/">Asynchronous Python for beginners</a></li>
          <li><a href="https://www.coursera.org/articles/what-is-asynchronous-learning">What Is Asynchronous</a></li>
        </ul>
        <h3>Дигар курсҳои омӯзишӣ бо воситаи Интернет:</h3>
        <ul>
          <li><a href="https://practicum.yandex.ru/async-python/">Онлайн-курс «Асинхронное программирование на Python</a></li>
          <li><a href="https://stepik.org/course/170777/continue">Асинхронный Python</a></li>
          <li><a href="https://metaclass.kts.studio/aiohttp">Асинхронное программирование на Python</a></li>
        </ul>
        <h3>Форумҳо ё дигар шаклҳои имконпазири муҳокимаи проблемаҳо дар Интернет:</h3>
        <ul>
          <li><a href="https://habr.com/ru/articles/667630/">Асинхронный python без головной боли</a></li>
          <li><a href="https://www.python.org/community/forums/">Forum</a></li>
          <li><a href="https://school.kontur.ru/publications/2567">Асинхронное программирование на Python</a></li>
        </ul>
        <h3>Муҳити коркарди нармафзор:</h3>
        <ul>
          <li><a href="https://pycharm-community.en.uptodown.com/windows">PyCharm</a></li>
          <li><a href="https://code.visualstudio.com/">Visual Studio Code</a></li>
          <li><a href="https://jupyter.org/">Jupyter</a></li>
        </ul>
        <h3>Онлайн муҳити санҷиши коди барномавӣ:</h3>
        <ul>
          <li><a href="https://www.online-ide.com/online_python_compiler#google_vignette">Online Python Compiler -
              OnlineIDE</a></li>
          <li><a href="https://bio-python.netlify.app/">Online Python - IDE, Editor, Compiler, Interpreter</a></li>
          <li><a href="https://pythoncompiler.com/">Python Compiler</a></li>
        </ul>
        <h3>Библиотека ва фреймворкҳои истифодашуда:</h3>
        <ul>
          <li><a href="https://docs.python.org/3/library/asyncio.html">asyncio — Asynchronous</a></li>
          <li><a href="https://trio.readthedocs.io/">Trio</a></li>
          <li><a href="https://www.tornadoweb.org/">Tornado Web Server</a></li>
        </ul>
        </div>
      </div>
    </div>
  </div>
</template>
<style scoped>
@import  '@/assets/pages.css'
</style>