<script setup lang="ts">

</script>

<template>
  <div class="bg-[#495055] px-12 pt-8 pb-6 text-[#c5c6c5]">
    <div class="lg:max-w-7xl w-full ml-auto mr-auto">
      <div class="lg:px-[64px] md:px-[32px] px-[24px] pt-[40px]">
        <div class="flex justify-between items-center">
          <p>
            Web-замимаи мазкур дар доираи рисолаи хатми тахассусӣ аз ҷониби дастаи хатмкунандагони ихтисосҳои “1-400102-02 Технология ва низоми иттилоотӣ (дар иқтисодиёт)” (Қосимова С.Д., Асирӣ М.Ф., Қодиров Н.Н.) ва ихтисоси “1-26 03 01 Идораи захираҳои иттилоотӣ” (Аминов А.Р.) сохта шудааст. <br> 
            Роҳбари илмӣ – дотсенти кафедраи иқтисоди рақамӣ Мақсудов Х.Т. <br>
            Мушовир – омӯзгори калони кафедраи иқтисоди рақамӣ Иномов Б.Б. <br>
            Таҳиягари асосӣ дар даста - Аминов А.Р. <br>

          </p>
          <img class="ml-32" src="@/assets/images/logo-footer.png" alt="">
        </div>
          <div class="pt-[50px] text-[12px]">
            © 2024 Донишкадаи политехникии Донишгоҳи техникии Тоҷикистон ба номи академик М.С.Осимӣ дар шаҳри Хуҷанд.
          </div>
        </div>
    </div>
  </div>
</template>