<template>
  <div class=" overflow-x-hidden">
    <div class="lg:max-w-7xl w-full ml-auto mr-auto">
      <div class="lg:px-[64px] bg-[#ECEFF1] shadow-lg my-10 rounded-3xl md:px-[32px] px-[24px] py-[40px]">
        <div class="py-[55px] flex items-center justify-between">
          <div class="z-50 ">
            <div class="text-customGreen">
              <h1 class="text-[86px] font-medium leading-[86px]">
                Харитаи
                роҳ
              </h1>
            </div>
            <div class="mt-[42px] text-[20px]">
              Ҳама чизро дар бораи харитаҳои роҳ пайдо кунед
            </div>
            <div class="mt-[60px] font-ibm mb-[32px] flex">
              <router-link to="/roadmap">
                <div
                  class="cursor-pointer rounded-[10px] border-solid mr-[10px] border-black border-[3px] px-[44px] py-[22px] text-[16px] leading-[155%] font-semibold">
                  Python Roadmap
                </div>
              </router-link>
            </div>
            <div class="flex mb-[10px] font-ibm text-[14px] text-center text-white">
              <div @click="goToStat()" class="bg-black rounded-[10px] cursor-pointer mr-[10px] col-span-6 px-[14px] py-[5px]">
                Харитаи роҳ чист?
              </div>
              <div @click="goToTools()" class="bg-black rounded-[10px] cursor-pointer col-span-6 px-[14px] py-[5px]">
                Асбобҳои мувофиқ
              </div>
            </div>
            <div class="flex font-ibm text-white text-[14px]">
              <div @click="goToAdvice()" class="bg-black rounded-[10px] cursor-pointer col-span-6 px-[14px] py-[5px]">
                Маслиҳат
              </div>
            </div>
          </div>
          <div class="block">
          </div>
        </div>
      </div>
    </div>
    <div class="lg:max-w-7xl w-full ml-auto mr-auto">
      <div class="lg:px-[64px] my-10 md:px-[32px] px-[24px] py-[40px]">
        <h2 id="what" class="text-5xl mb-[27px] leading-[74px]">
          <span class="text-customGreen">Харитаи роҳ</span> чист?
        </h2>
        <p class="text-[20px]">
          Дар аввал биёед мефаҳмем, ки харитаи роҳ дар таҳияи нармафзор чист.Ин як навъ нақшаи стратегӣ мебошад, ки
          роҳи рушди лоиҳаи шуморо дар як вақти муайян тавсиф мекунад. Харитаи роҳ ҳадафҳо, марҳилаҳо, мӯҳлат ва
          афзалиятҳоро дар бар мегирад. Он ба шумо ва дастаи шумо дар роҳи дуруст мондан ва ба самти дуруст ҳаракат
          кардан кӯмак мекунад
        </p>
      </div>
    </div>
    <div class="lg:max-w-7xl w-full ml-auto mr-auto">
      <div class="lg:px-[64px] my-10 md:px-[32px] px-[24px] py-[40px]">
        <h2 class="text-5xl mb-[27px] leading-[74px]">
          Барои чи <span class="text-customGreen">харитаи роҳ</span> <br> дар рушди касб лозим аст
        </h2>
        <p class="text-[20px]">
          Харитаи роҳ бешубҳа воситаи пурқувват барои рушди касб аст ва он метавонад дар сенарияҳои гуногун истиярла
          бурдан мумкин аст. Дар мақолаи мазкур мо якчанд ҳолатҳоеро дида мебароем, ки дар он сохтан ва истифода бурдани
          харитаи роҳ метавонад метавонад муфидтар бошад.
        </p>
        <div class="mt-[40px]">
          <div class="grid grid-cols-2 gap-[60px]">
            <h5 class="text-[30px] col-span-1 font-semibold">1. Барои навёдгироне, ки роҳи худро дар соҳаи таҳиягари
              меҷӯянд</h5>
            <div class="col-span-1">
              <info-block>
                Ҳангоми ки шумо нав дар соҳаи таҳиягари роҳи худр оғоз мекунед, он калон ва инчунин печида ба назар
                расад.Харитаи роҳ барои муайянкунии самт, хадафҳо ва қадамҳои худ, барои ноил шудан ба онҳо ёри
                мерасонад. Шумо метавонед аниқ муайян кунед, ки барои пеш рафтан ба шумо чӣ гуна малака ва дониш лозим
                аст.
              </info-block>
            </div>
            <div class="col-span-1">
              <info-block>
                Баъзан чунин мешавад, ки шумо муддати дароз дар як вазифа кор кардаед ва ҳис мекунед, ки имкониятҳои
                шумо маҳдуданд. Харитаи роҳ ба шумо имконият медиҳад ки кадом қадамҳо,ба шумо барои пеш рафтан дар
                соҳаи худ лозим аст. Он метавонад ба шумо барои муайян кардани малакаҳои нав кӯмак кунад, ки барои
                гузаштан ба сатҳи дигар лозим мешавад.
              </info-block>
            </div>
            <h5 class="text-[30px] col-span-1 font-semibold">2. Барои онҳое ки дар як мақеъ “дармондаанд”</h5>
            <h5 class="text-[30px] col-span-1 font-semibold">3. Барои тағийр додани самти таҳиягари</h5>
            <div class="col-span-1">
              <info-block>
                Баъзан чунин ҳолат мешавад ки шумотногаҳ ба соҳаи дигар, ки ба шумо писанд меояд равона шавед. Мисол ,
                шумо мехоҳед аз тестирони ба лоиҳаҳои менеҷмент гузаред, ба монанди мисоли дар боло овардашуда. Дар ин
                ҳолат харитаи роҳ ба шумо дастури беҳтарин шуда метавонад. Он ба шумо ки гузариш ба қами навбатиро
                ба нақша гирифтан, қадамҳои заруриро муайян кардан ва ҳатто боварӣ ҳосил кардае, ки малакаҳои қаблан
                гирифтаатонро фаромӯш накардан кӯмак мерасонад.
              </info-block>
            </div>
            <div class="col-span-1">
              <info-block>
                Ҳангоме ки шумо ба мусоҳиба барои вазифаи нав ё ба ширкати дигар омодаги мебинед харитаи роҳ ба шумо
                “шпаргалка” шуда метавонад.Он ба шумо барои равшантар дидани дастовардҳо ва малакаҳои худ, камбудиҳои
                эҳтимолӣ ё фаромӯшкуниро бартараф кардан кӯмак мекунад. Шумо бешубҳа, ба саволҳо дар бораи роҳи касбии
                худ равшан ва устуворона ҷавоб диҳед.
              </info-block>
            </div>
            <h5 class="text-[30px] col-span-1 font-semibold">4. Дар вақти тайёри ба мусоҳиба(суҳбат барои ба кор қабул
              намудан)</h5>
          </div>
        </div>
      </div>
    </div>
    <div class="lg:max-w-7xl w-full ml-auto mr-auto">
      <div class="lg:px-[64px] my-10 md:px-[32px] px-[24px] py-[40px]">
        <h2 class="text-5xl mb-[27px] leading-[74px]">
          Чи тавр бояд <span class="text-customGreen">харитаи роҳ</span> тартиб дода шавад.
        </h2>
        <p class="text-[20px]">
          Ҳангоми ки шумо мақсади худро аниқ тасвир мекунед, кадами навбати шумо муайян кардани амалҳои аниқ , қадамҳо
          ва малакаҳомебошад ки барои ноил шудан ба максадхои худ лозим мешавад. Ин тавр шумо метавонед ин корро кунед:
        </p>
        <div class="mt-[60px]">
          <step-block>
            <template #header>
              1. Мақсади ниҳоии хуро аниқ муайян кунед
            </template>
            Дар аввали муайян кунед ки шумо маҳз ба чӣ ноил шудан мехоҳед. Мақсади шумо бояд мушаххас, ченшаванда,
            дастрас, далхлдор
            ва маҳдуд ба вақт бошад. Мисол ба ин шуда метавонад ҳаракати веб-тагиягари маъруф шудан ё аз худ кардани
            зеҳни сунъи .
          </step-block>
          <step-block>
            <template #header>
              2. Мақсади худро ба қадамҳо тақсим намоед
            </template>
            Мақсади калони худро ба қадамҳои хурд ва идорашаванда тақсим кунед. Ин ба шумо нағзтар фаҳмидан ва ба пеш
            ҳаракат
            кардан ёри мерасонад. Агар мақсади шумо веб-таҳиягари сатҳи баланд шудан бошад, ин қадамҳо метавонанд
            омӯзиши забонҳои
            гуногуни барномасозӣ, фреймворкҳо, сохтани портфолио ва ҷустуҷӯи корро дар бар гиранд.
          </step-block>
          <step-block>
            <template #header>
              3. Муайян кардани малака ва донишҳои зарурӣ
            </template>
            Барои ҳар як марҳила муайян кунед, ки чӣ гуна малака ва дониши мушаххас ба шумо лозим аст. Масалан, агар
            шумо хоҳед,
            ки Python-ро омӯзед, ин метавонад омӯзиши синтаксиси он, асосҳои барномасозӣ ва кор бо китобхонаҳо ва
            фреймворкҳоро
            дар бар гирад.
          </step-block>
          <step-block>
            <template #header>
              4. Мӯҳлати иҷроишро муайян кунед
            </template>
            Барои ҳар як марҳила мӯҳлати муайян муқаррар намоед. Ин ба шумо вақти худро самараноктар ташкил кардан ва
            пешрафти
            худро пайгирӣ кардан кӯмак мекунад. Асосаш ин аст ки, мӯҳлатро воқеӣ ва дастрас бошад.
          </step-block>
          <step-block>
            <template #header>
              5. Муайян кардани захираҳои лозимӣ
            </template>
            Муайян кунед, ки барои ҳар як марҳила кадом захираҳо лозиманд. Ин метавонад китобҳои дарсӣ, курсҳои онлайн,
            менторҳо,
            лоиҳаҳои амалӣ ва дигар маводи таълимиро дар бар гирад.
          </step-block>
          <step-block>
            <template #header>
              6. Нақшаи муфассали амалро таҳия кунед
            </template>
            Барои ҳар як марҳила нақшаи мушаххасеро таҳия кунед, ки дар он тавсифи кадом қадамҳо бояд андешида шаванд.
            Ин
            метавонад рӯйхати вазифаҳо ё пайдарпайии амалҳо бошад.
          </step-block>
          <step-block>
            <template #header>
              7. Пешрафти худро баҳогузори кунед ва харитаи роҳро мутобиқ кунед
            </template>
            Пешрафти худро мунтазам пайгирӣ кунед ва онро бо мӯҳлати гузошташуда муқоиса кунед. Агар ягон амалиёт аз рӯи
            нақша
            нашавад ё шумо мақсади гузоштаатон тағйир ёбад, устувор бошед ва барои ислоҳ кардани Ххритаи роҳ омода
            бошед.
          </step-block>
          <step-block>
            <template #header>
              8. Аз дастовардҳои гирифтаатон дарс гирифтан
            </template>
            Вақте ки шумо ба ҳар як марҳила мерасед, натиҷаҳои худро таҳлил кунед ва дарс гиред. Ин ба шумо
            бароипешбурди равиши
            кор ва беҳтар созед ва ба сӯи ҳадафи ниҳоии худ ҳаракат кунед.
          </step-block>
        </div>
        <div class="mt-[60px]">
          <p class="text-[20px]">
            Сохтани харитаи роҳ - як воситаи пурқувватест, ки ба шумо кӯмак мекунад, ки бомуваффақият ба сӯи
            ҳадафҳои
            худ
            ҳаракат кунед. Дар хотир нигоҳ доред, ки харитаи роҳ шумо метавонад дар асоси таҷрибаи шумо ва дар
            ҳолатҳои
            ивазшашанда тағйир ёбад.
          </p>
        </div>
      </div>
    </div>
    <div class="lg:max-w-7xl w-full ml-auto mr-auto">
      <div class="lg:px-[64px] my-10 md:px-[32px] px-[24px] py-[40px]">
        <h2 id="advice" class="text-5xl mb-[27px] leading-[74px]">
          Маслиҳат
        </h2>
        <p class="text-[20px]">
          Ҳангоми таҳияи харитаи роҳ барои пешравии худ, муҳим аст, ки дурнамои оптималии вақтро дар назар доштан
          лозим
          аст. Тавсия дода мешавад, ки давраи аз 1,5 то 5 сол барои банақшагирӣ мувофиқтарин интихоб карда шавад. Чаро?
        </p>
        <div class="mt-[60px]">
          <div class="grid grid-cols-2 gap-10">
            <div class="flex rounded-[20px] shadow-md col-span-1 p-5">
              <h5 class="text-customGreen mr-5 font-medium text-3xl">
                [1]
              </h5>
              <p class="text-[20px]">
                Аввалан, бозори-IT бо суръати баланд тағйир меёбад ва пешгӯии трендҳо дар муддати дароз метавонад
                нодуруст
                бошад.
              </p>
            </div>
            <div class="flex rounded-[20px] shadow-md col-span-1 p-5">
              <h5 class="text-customGreen mr-5 font-medium text-3xl">
                [2]
              </h5>
              <p class="text-[20px]">
                Дуюм, гузоштани мақсадҳои бузурги дарозмуддат хеле хуб аст, аммо дуруст тақсим кардани онҳо ба қадамҳои
                хурд
                душвор шуда метавонад. Ин метавонад хатари дарозмуддат шудан ё ҳатто тағир додани нақшаҳоро дар миёна
                афзоиш
                диҳад.
              </p>
            </div>
          </div>
        </div>
        <p class="text-[20px] mt-[60px]">
          Интихоби вақти муайян 1,5 то 5 сол ба шумо кӯмак мекунад, ки ба нақша гиред ва ҳадафҳои воқеӣ ба даст оред, бо
          нигоҳ доштани ҳавасмандӣ ва ба фикрҳои актуали назар кардан.
        </p>
      </div>
    </div>
    <div class="lg:max-w-7xl w-full ml-auto mr-auto">
      <div class="lg:px-[64px] mb-10 md:px-[32px] px-[24px] py-[40px]">
        <div class="flex items-center">
          <h2 id="tools" class="text-5xl mb-[27px] leading-[74px]">
            Дар куҷо харитаи роҳ сохтан мумкин аст: <span class="text-customGreen">Асбобҳои мувофиқ</span> 
          </h2>
          <img class="w-96" src="@/assets/images/road.png" alt="">
        </div>
        <div class="text-[20px]">
          <p class="">
            Шумо метавонед харитаи роҳро дар қариб ҳама асбобҳое созед, ки ба шумо мувофиқ аст, ҳатто Google Sheets ё Microsoft Word. Аммо, сервисҳои махсусе ҳастанд, ки ин равандро содда мекунанд. Маъмултаринҳояш  Miro, WEEEK ва drawe.io мебошанд.
          </p>
          <br>
          <p>
            Ин сервисҳо имкониятҳои васеъ барои сохтан ва визуалии Харитаи роҳро фароҳам меоранд ва инчунин дар ҳолати зарурӣ ҳамкорӣ ва табодули иттилоотро бо дигар аъзои даста имкон медиҳанд.
          </p>
          <br>
          <p>
            Интихоби асбовб аз афзалиятҳо ва мақсадҳои шумо вобаста аст, аммо чизи асосӣ ин аст, ки нақшаи аниқи  рушд ва асбобе дошта бошед, ки онро ба ҳаёт татбиқ карда шавад.
          </p>
        </div>
      </div>
    </div>
    <div class="lg:max-w-7xl w-full ml-auto mr-auto">
      <div class="lg:px-[64px] mb-10 md:px-[32px] px-[24px] py-[40px]">
        <h2 class="text-5xl mb-[27px] leading-[74px]">
          <span class="text-customGreen">Барномасоз</span> чи тавр харитаи роҳро ҷустуҷӯ карда метавонад
        </h2>
        <p class="text-[20px]">
          Тартиб додани харитаи роҳ худ хусусан барои навёдгирон душвор аст. Барои ин яке аз усулҳои муфид ин аз Харитаи роҳи тайёр истифода намудан аст, ки дар он аллакай захираҳои тайёр мавҷуд аст. унин захираҳои тайёр вуҷуд доранд ва онҳо метавонанд роҳи рушди шуморо хеле осон кунанд. Якчанд маслиҳат дар бораи аз куҷо ва чӣ гуна ҷустуҷӯ кардани онҳо:  
        </p>
         <div class="mt-10">
          <source-container>
            <template #header>
              Roadmap.sh
            </template>
            Вебсайти roadmap. sh маҷмӯи васеи харитаи роҳро барои ихтисосҳои гуногуни технологӣ пешкаш мекунад. Ин харитаҳои роҳ дар шакли диаграмма оварда шудаанд ва рӯйхати малакаҳо ва истинодҳоро ба маводи муфиди омӯзишӣ дар бар мегиранд. Ин манбаъ ройгон аст ва доим нав карда мешавад.
          </source-container>
          <source-container>
            <template #header>
              GitHub
            </template>
            Платформаи GitHub  ин як манба муфиди харитаи роҳ шуда метавонад. Бисёр таҳиягарон ва ҷомеаҳои барномасозон репазитори бо харитаи роҳ барои забонҳои гуногуни барномасози ва стекҳои техналогӣ месозанд. Шумо GitHub – ро барои ҷустуҷӯи харитаи роҳи мувофиқ истифода баред 
          </source-container>
          <source-container>
            <template #header>
              Платформаҳои таълими
            </template>
            Баъзе аз платформаҳои таълими ба монанди Coursera edX ва Udacity, барномаҳои таълимии тайёрро пешниҳод мекунанд, ки харитаи роҳ ва курсҳоро барои ихтисосҳои гуногун дар бар мегиранд. Ин барномаҳо метавонанд пулакӣ шуда метавонанд, инчунин онҳо одатан маводи сохторӣ ва баландсифатро таъмин мекунанд.
          </source-container>
          <source-container>
            <template #header>
              Форумҳо ва ҷомеаҳои барномасозон
            </template>
            Иштирокчиёни IT-дастаҳо барномасозон ба монанди Stack Overflow, Reddit ва Dev. to, харитаи роҳи худро мубодила ва тавсия диҳанд. Ҷустуҷӯ аз чунин ҷомеаҳои барномасозон ба захираҳои муфид оварда мерасонад.
          </source-container>
          <source-container>
            <template #header>
              Блоги и YouTube-каналы
            </template>
            Бисёре аз барномасозони ботаҷриба блогҳо ё каналҳои YouTube доранд, ки дар онҳо таҷрибаҳои худро мубодила мекунанд ва харитаи роҳро барои соҳаҳои мушаххаси технологӣ ямесозанд. Омузиши материалхои онхо хеле фоиданок буда метавонад.
          </source-container>
         </div>
         <p class="mt-[60px] text-[20px]">
          Дар хотир доред, ки ҳарчанд харитаи роҳ метавонанд роҳнамои муфид бошанд, онҳо на ҳама вақт барои ҳама мувофиқанд. Мақсадҳо ва ниёзҳои шахсии шумо метавонанд гуногун бошанд, аз ин рӯ фикри хуб аст, ки роҳанамои рақамиҷҷро мувофиқи вазъият ва манфиатҳои беназири худ созед.
         </p>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import { infoBlock, stepBlock, sourceContainer } from './components';
import { RouterLink } from 'vue-router';
const goToStat = (): void => {
  const stat = document.getElementById('what')

  if (stat !== null) {
    stat.scrollIntoView({
      behavior: 'smooth',
      block: 'start'
    })
  }
}
const goToTools = (): void => {
  const info = document.getElementById('tools')
  if (info !== null) {
    info.scrollIntoView({
      behavior: 'smooth',
      block: 'start'
    })
  }
}
const goToAdvice = (): void => {
  const dev = document.getElementById('advice')
  if (dev !== null) {
    dev.scrollIntoView({
      behavior: 'smooth',
      block: 'start'
    })
  }
}
</script>

<style>
.spin-block {
  animation: spin 45s linear infinite;
}

@keyframes spin {
  from {
    transform: rotate(0deg);
  }

  to {
    transform: rotate(360deg);
  }
}

.stepEnd::before {
  content: '';
  width: 9px;
  height: 9px;
  background-color: #000;
  position: absolute;
  display: block;
  top: 8px;
}
</style>